{
  "Logging": {
    "LogLevel": {
      "Default": "Information",
      "Microsoft": "Warning",
      "Microsoft.Hosting.Lifetime": "Information"
    }
  },
  "MailSettings": {
    "Mail": "scur004@gmail.com", //Die E-Mail Adresse, von welcher die E-Mail aus gesendet werden soll: null,
    "DisplayName": "Name", //Weiß nicht wofür, wird nirgendwo angezeigt
    "Password": "mfvtsjpwonikqwlo", //Passwort des E-Mail Accounts -> ist nicht das normale Kennwort sondern wird generiert (App-Passwort), siehe unten für mehr Infos: null,
    "Host": "smtp.gmail.com",
    "Port": 587
  },
  "AllowedHosts": "*"
}

//https://support.google.com/accounts/answer/185833?hl=en

//Sign in with App Passwords
//Tip: App Passwords aren’t recommended and are unnecessary in most cases. To help keep your account secure, use "Sign in with Google" to connect apps to your Google Account. 

//An App Password is a 16-digit passcode that gives a less secure app or device permission to access your Google Account. App Passwords can only be used with accounts that have 2-Step Verification turned on.

//When to use App Passwords
//Tip: iPhones and iPads with iOS 11 or up don’t require App Passwords. Instead use “Sign in with Google.”

//If the app doesn’t offer “Sign in with Google,” you can either:

//Use App Passwords
//Switch to a more secure app or device
//Create & use App Passwords
//If you use 2-Step-Verification and get a "password incorrect" error when you sign in, you can try to use an App Password.

//Go to your Google Account.
//Select Security.
//Under "Signing in to Google," select App Passwords. You may need to sign in. If you don’t have this option, it might be because:
//2-Step Verification is not set up for your account.
//2-Step Verification is only set up for security keys.
//Your account is through work, school, or other organization.
//You turned on Advanced Protection.
//At the bottom, choose Select app and choose the app you using and then Select device and choose the device you’re using and then Generate.
//Follow the instructions to enter the App Password. The App Password is the 16-character code in the yellow bar on your device.
//Tap Done.
//Tip: Most of the time, you’ll only have to enter an App Password once per app or device, so don’t worry about memorizing it.